tests/performance/IS_Proxy_Stress_Test_Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="IS_Proxy_Stress_Test_Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="Plan HTTP Request Defaults">
        <stringProp name="HTTPSampler.domain">${Apim_Env}${Apim_Domain}</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <CacheManager guiclass="CacheManagerGui" testclass="CacheManager" testname="Plan HTTP Cache Manager" enabled="true">
        <boolProp name="clearEachIteration">true</boolProp>
        <boolProp name="useExpires">true</boolProp>
        <boolProp name="CacheManager.controlledByThread">false</boolProp>
      </CacheManager>
      <hashTree/>
      <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="AWS Secrets Manager - JSR223 PreProcessor" enabled="true">
        <stringProp name="scriptLanguage">groovy</stringProp>
        <stringProp name="cacheKey">false</stringProp>
        <stringProp name="script">// AWS SDK JARs must be placed in JMETER_HOME/lib directory
// Required JARs (download from Maven Central):
// - aws-java-sdk-secretsmanager-1.12.529.jar
// - aws-java-sdk-core-1.12.529.jar

import com.amazonaws.auth.DefaultAWSCredentialsProviderChain
import com.amazonaws.services.secretsmanager.AWSSecretsManagerClientBuilder
import com.amazonaws.services.secretsmanager.model.GetSecretValueRequest
import com.amazonaws.services.secretsmanager.model.GetSecretValueResult
import groovy.json.JsonSlurper

try {
    // Get the secret name from JMeter variable or use default
    String secretName = vars.get(&quot;AWS_SECRET_NAME&quot;)
    String region = vars.get(&quot;AWS_REGION&quot;) ?: &quot;eu-west-2&quot;
    String awsProfile = vars.get(&quot;AWS_PROFILE&quot;) ?: &quot;default&quot;

    log.info(&quot;Fetching secret: ${secretName} from region: ${region}&quot;)

    // Create AWS Secrets Manager client using default credentials chain
    // This will use: environment variables, system properties, AWS credentials file, IAM role
    def client = AWSSecretsManagerClientBuilder.standard()
        .withRegion(region)
        .withCredentials(new DefaultAWSCredentialsProviderChain())
        .build()

    // Create request to get secret value
    GetSecretValueRequest getSecretValueRequest = new GetSecretValueRequest()
        .withSecretId(secretName)

    // Retrieve the secret
    GetSecretValueResult getSecretValueResult = client.getSecretValue(getSecretValueRequest)
    String secretString = getSecretValueResult.getSecretString()

    log.info(&quot;Successfully retrieved secret&quot;)

    // Parse the JSON secret string
    def jsonSlurper = new JsonSlurper()
    def secretJson = jsonSlurper.parseText(secretString)

    // Process key-value pairs and set them as JMeter variables
    secretJson.each { key, value -&gt;
        vars.put(key as String, value as String)
        log.info(&quot;Set variable: ${key}&quot;)
    }

    log.info(&quot;Successfully processed ${secretJson.size()} key-value pairs from secret&quot;)

} catch (ClassNotFoundException e) {
    log.error(&quot;AWS SDK classes not found. Please ensure AWS SDK JARs are in JMETER_HOME/lib directory&quot;)
    log.error(&quot;Error: ${e.message}&quot;, e)
} catch (Exception e) {
    log.error(&quot;Error fetching or processing AWS secret: ${e.message}&quot;, e)
    e.printStackTrace()
    // Optionally fail the test or continue with default values
    // throw e
}
</stringProp>
      </JSR223PreProcessor>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Organization Requests" enabled="true">
        <intProp name="ThreadGroup.num_threads">1400</intProp>
        <intProp name="ThreadGroup.ramp_time">60</intProp>
        <longProp name="ThreadGroup.duration">3600</longProp>
        <longProp name="ThreadGroup.delay">0</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer" enabled="true">
          <collectionProp name="load_profile">
            <collectionProp name="-1120911667">
              <stringProp name="48">0</stringProp>
              <stringProp name="48780">150</stringProp>
              <stringProp name="50547">300</stringProp>
            </collectionProp>
            <collectionProp name="-1672724898">
              <stringProp name="start_rps">200</stringProp>
              <stringProp name="49586">200</stringProp>
              <stringProp name="50547">300</stringProp>
            </collectionProp>
            <collectionProp name="-750545620">
              <stringProp name="49741">250</stringProp>
              <stringProp name="49741">250</stringProp>
              <stringProp name="50547">300</stringProp>
            </collectionProp>
            <collectionProp name="1760967596">
              <stringProp name="50547">300</stringProp>
              <stringProp name="50547">300</stringProp>
              <stringProp name="50547">300</stringProp>
            </collectionProp>
            <collectionProp name="1826931628">
              <stringProp name="50702">350</stringProp>
              <stringProp name="50702">350</stringProp>
              <stringProp name="50547">300</stringProp>
            </collectionProp>
            <collectionProp name="-1444112116">
              <stringProp name="51508">400</stringProp>
              <stringProp name="51508">400</stringProp>
              <stringProp name="50547">300</stringProp>
            </collectionProp>
            <collectionProp name="-1402042388">
              <stringProp name="51663">450</stringProp>
              <stringProp name="51663">450</stringProp>
              <stringProp name="50547">300</stringProp>
            </collectionProp>
            <collectionProp name="-378118836">
              <stringProp name="52469">500</stringProp>
              <stringProp name="52469">500</stringProp>
              <stringProp name="50547">300</stringProp>
            </collectionProp>
            <collectionProp name="-312154804">
              <stringProp name="52624">550</stringProp>
              <stringProp name="52624">550</stringProp>
              <stringProp name="50547">300</stringProp>
            </collectionProp>
            <collectionProp name="712539532">
              <stringProp name="53430">600</stringProp>
              <stringProp name="53430">600</stringProp>
              <stringProp name="50547">300</stringProp>
            </collectionProp>
            <collectionProp name="753838476">
              <stringProp name="53585">650</stringProp>
              <stringProp name="53585">650</stringProp>
              <stringProp name="50547">300</stringProp>
            </collectionProp>
            <collectionProp name="1778532812">
              <stringProp name="54391">700</stringProp>
              <stringProp name="54391">700</stringProp>
              <stringProp name="50547">300</stringProp>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.timers.VariableThroughputTimer>
        <hashTree/>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="Organization Request Transaction Controller">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
        </TransactionController>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Generate JWT Token - JSR223 PreProcessor" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import com.auth0.jwt.JWT;
import com.auth0.jwt.algorithms.Algorithm;

import java.io.IOException;
import java.security.KeyFactory;
import java.security.interfaces.RSAPrivateKey;
import java.security.spec.PKCS8EncodedKeySpec;
import java.util.Base64;
import java.util.Date;
import java.util.Map;
import java.util.UUID;
import java.nio.file.Files;
import java.nio.file.Path;
import java.io.IOException;


public static String readFileContent(Path filePath) throws IOException {
    return new String(Files.readAllBytes(filePath));
}
    String apikey = vars.get(&quot;api_key&quot;);
    String kid_name = vars.get(&quot;kid&quot;);
    String key = vars.get(&quot;private_key&quot;)
    tokenExpireTime = 300000;
//    String key = readFileContent(Path.of(&quot;parameter_files/&quot;+kid_name+&quot;.pem&quot;));


    // Set cert to the main part of the key
    String[] parts = key.split(&quot;-----&quot;);
    String cert = parts[2];

    // Load private key file
    String privateKeyPem = cert.replaceAll(&quot;\\s&quot;, &quot;&quot;);


    byte[] keyBytes = Base64.getDecoder().decode(privateKeyPem);
    PKCS8EncodedKeySpec spec = new PKCS8EncodedKeySpec(keyBytes);
    KeyFactory kf = KeyFactory.getInstance(&quot;RSA&quot;);
    RSAPrivateKey privateKey = (RSAPrivateKey) kf.generatePrivate(spec);

    String apim_env = vars.get(&quot;Apim_Env&quot;);
    String apim_domain = vars.get(&quot;Apim_Domain&quot;);
    // String fullendpoint = &quot;https://&quot;+apim_env+apim_domain+&quot;/oauth2/token&quot;;
    String fullendpoint = vars.get(&quot;token_url&quot;);
    log.info(fullendpoint);
    String subject = apikey;
    String issuer = apikey;
    String audience = fullendpoint;
    String jwtId = UUID.randomUUID().toString();
    long nowMillis = System.currentTimeMillis();
    long expMillis;
    if(tokenExpireTime==5000000){
        expMillis = nowMillis;
    } else {
          expMillis = nowMillis + tokenExpireTime; // 5 minutes
    }

    Algorithm algorithm = Algorithm.RSA512(null, privateKey);

    def JWT_Token = JWT.create()
            .withSubject(subject)
            .withIssuer(issuer)
            .withAudience(audience)
            .withJWTId(jwtId)
            .withExpiresAt(new Date(expMillis))
            .withHeader(Map.of(&quot;kid&quot;, kid_name))
            .sign(algorithm);

    //Save the JWT in the compact string in the jmeter variables
    vars.put(&quot;JWT_Token&quot;, JWT_Token);
</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get Bearer Token" enabled="true">
            <stringProp name="HTTPSampler.path">/oauth2/token</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments">
                <elementProp name="grant_type" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">client_credentials</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                  <boolProp name="HTTPArgument.use_equals">true</boolProp>
                  <stringProp name="Argument.name">grant_type</stringProp>
                  <stringProp name="HTTPArgument.content_type">text/plain</stringProp>
                </elementProp>
                <elementProp name="client_assertion_type" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">urn:ietf:params:oauth:client-assertion-type:jwt-bearer</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                  <boolProp name="HTTPArgument.use_equals">true</boolProp>
                  <stringProp name="Argument.name">client_assertion_type</stringProp>
                  <stringProp name="HTTPArgument.content_type">text/plain</stringProp>
                </elementProp>
                <elementProp name="client_assertion" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">${JWT_Token}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                  <boolProp name="HTTPArgument.use_equals">true</boolProp>
                  <stringProp name="Argument.name">client_assertion</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">content-type</stringProp>
                  <stringProp name="Header.value">application/x-www-form-urlencoded</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">varBearer</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.access_token</stringProp>
              <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            </JSONPostProcessor>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Organization Request">
            <stringProp name="HTTPSampler.path">/dos-search-ftrs-1380/FHIR/R4/Organization?_revinclude=Endpoint%3Aorganization&amp;identifier=odsOrganisationCode%7C${ep_odscode}</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="ODSCode Parameters" enabled="true">
              <stringProp name="delimiter">,</stringProp>
              <stringProp name="filename">parameter_files/dos_search_odscodes.csv</stringProp>
              <boolProp name="ignoreFirstLine">true</boolProp>
              <boolProp name="quotedData">false</boolProp>
              <boolProp name="recycle">true</boolProp>
              <stringProp name="shareMode">shareMode.group</stringProp>
              <boolProp name="stopThread">false</boolProp>
              <stringProp name="variableNames">ep_odscode</stringProp>
            </CSVDataSet>
            <hashTree/>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">Bearer ${varBearer}</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="Apim_Domain" elementType="Argument">
            <stringProp name="Argument.name">Apim_Domain</stringProp>
            <stringProp name="Argument.value">.api.service.nhs.uk</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Load Plan Level Parameters JSR223 PreProcessor" enabled="true">
        <stringProp name="scriptLanguage">groovy</stringProp>
        <stringProp name="cacheKey">true</stringProp>
        <stringProp name="script">def scriptFile = new File(&apos;./scripts/LoadApimParams.groovy&apos;)
def scriptText = scriptFile.text
evaluate(scriptText)</stringProp>
      </JSR223PreProcessor>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>